#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo_cmk.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cmk/ebs"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.demo_cmk.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 30
      + description              = "CMK that will be used to encrypt all of the EBS goodness."
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::964773121628:root"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyOwnerPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Lint`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./example`, Workspace: `default`*
